Revit 2024 API
Stone.StonePatternAmount Property
 The property labeled "Amount" from the "Stone" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string StonePatternAmount { get; }
Visual Basic
Public Shared ReadOnly Property StonePatternAmount As String
	Get
Visual C++
public:
static property String^ StonePatternAmount {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 2".
See Also
Stone Class
Autodesk.Revit.DB.Visual Namespace